org/blog/2021/lc-453-minimum-moves-to-equal-array-elements.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: LC453. 最小操作次数使数组元素相等

今天思考 LeetCode 题目：最小操作次数使数组元素相等[fn:1]。

* 题目表述

给你一个长度为 =n= 的整数数组，每次操作将会使 =n - 1= 个元素增加 =1= 。返回让数组所有元素相等的最小操作次数。

* 题解[fn:2]

#+begin_src js
  /**
   * @param {number[]} nums
   * @return {number}
   */
  let minMoves = function(nums) {
    const minNum = Math.min(...nums);
    let res = 0;
    for (const num of nums) {
      res += num - minNum;
    }
    return res;
  }
#+end_src

代码使用了全局对象 =Math= ，它是有属性和方法的内建对象，适合处理数学常量和函数。它不是函数对象[fn:3]。

[fn:1] https://leetcode-cn.com/problems/minimum-moves-to-equal-array-elements/

[fn:2] https://leetcode-cn.com/problems/minimum-moves-to-equal-array-elements/solution/zui-xiao-cao-zuo-ci-shu-shi-shu-zu-yuan-3meg3/

[fn:3] https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Math
