blog/2021/lc-453-minimum-moves-to-equal-array-elements.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 16:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LC453. 最小操作次数使数组元素相等</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">LC453. 最小操作次数使数组元素相等</h1>
</header><p>
今天思考 LeetCode 题目：最小操作次数使数组元素相等<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>

<div id="outline-container-orgdab1021" class="outline-2">
<h2 id="orgdab1021">题目表述</h2>
<div class="outline-text-2" id="text-orgdab1021">
<p>
给你一个长度为 <code>n</code> 的整数数组，每次操作将会使 <code>n - 1</code> 个元素增加 <code>1</code> 。返回让数组所有元素相等的最小操作次数。
</p>
</div>
</div>

<div id="outline-container-orga7fa4f9" class="outline-2">
<h2 id="orga7fa4f9">题解<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-orga7fa4f9">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #7c7565;">/**</span>
<span style="color: #7c7565;"> * @param {number[]} nums</span>
<span style="color: #7c7565;"> * @return {number}</span>
<span style="color: #7c7565;"> */</span>
<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">minMoves</span> = <span style="color: #91a0b3;">function</span>(<span style="color: #aaca86;">nums</span>) {
  <span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">minNum</span> = Math.min(...nums);
  <span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">res</span> = 0;
  <span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">num</span> of nums) {
    res += num - minNum;
  }
  <span style="color: #91a0b3;">return</span> res;
}
</pre>
</div>

<p>
代码使用了全局对象 <code>Math</code> ，它是有属性和方法的内建对象，适合处理数学常量和函数。它不是函数对象<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/minimum-moves-to-equal-array-elements/">https://leetcode-cn.com/problems/minimum-moves-to-equal-array-elements/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/minimum-moves-to-equal-array-elements/solution/zui-xiao-cao-zuo-ci-shu-shi-shu-zu-yuan-3meg3/">https://leetcode-cn.com/problems/minimum-moves-to-equal-array-elements/solution/zui-xiao-cao-zuo-ci-shu-shi-shu-zu-yuan-3meg3/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Math">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Math</a>
</p></div></div>


</div>
</div></div>
</body>
</html>